# <font color="purple"><h3 align="center">Pandas Concatenate and Merge</h3></font>

## <font color='blue'>Basic Concatenation</font>

In [8]:
import pandas as pd

india_weather=pd.DataFrame({
    "city" : ["Mumbai","Chennai","Hyderabad"],
    "temperature": [34,41,32],
    "humidity": [78,58,75]
})
india_weather

        city  temperature  humidity
0     Mumbai           34        78
1    Chennai           41        58
2  Hyderabad           32        75

In [9]:
usa_weather=pd.DataFrame({
    "city" : ["Washington","New York","Chicago"],
    "temperature": [28,20,16],
    "humidity": [58,68,75]
})
usa_weather

         city  temperature  humidity
0  Washington           28        58
1    New York           20        68
2     Chicago           16        75

In [10]:
df=pd.concat([india_weather,usa_weather])
df

         city  temperature  humidity
0      Mumbai           34        78
1     Chennai           41        58
2   Hyderabad           32        75
0  Washington           28        58
1    New York           20        68
2     Chicago           16        75

## <font color='blue'>Ignore Index</font>

In [11]:
df=pd.concat([india_weather,usa_weather],ignore_index=True)
df

         city  temperature  humidity
0      Mumbai           34        78
1     Chennai           41        58
2   Hyderabad           32        75
3  Washington           28        58
4    New York           20        68
5     Chicago           16        75

In [12]:
df.loc[1]

city           Chennai
temperature         41
humidity            58
Name: 1, dtype: object

## <font color='blue'>Concatenation And Keys</font>

In [13]:
df = pd.concat([india_weather, usa_weather], keys=["INDIA", "USA"])
df

               city  temperature  humidity
INDIA 0      Mumbai           34        78
      1     Chennai           41        58
      2   Hyderabad           32        75
USA   0  Washington           28        58
      1    New York           20        68
      2     Chicago           16        75

In [14]:
df.loc["INDIA"]

        city  temperature  humidity
0     Mumbai           34        78
1    Chennai           41        58
2  Hyderabad           32        75

## <font color='blue'>Concatenation Using Index</font>

In [15]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
temperature_df

       city  temperature
0    mumbai           32
1     delhi           45
2  banglore           30

In [16]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","banglore","mumbai"],
    "windspeed": [7,12,10],
}, index=[1,2,0])
windspeed_df

       city  windspeed
1     delhi          7
2  banglore         12
0    mumbai         10

In [19]:
df = pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature      city  windspeed
0    mumbai           32    mumbai         10
1     delhi           45     delhi          7
2  banglore           30  banglore         12

## <font color='blue'>MERGE</font>

In [20]:
df=pd.merge(temperature_df,windspeed_df,on='city')
df

       city  temperature  windspeed
0    mumbai           32         10
1     delhi           45          7
2  banglore           30         12

## <font color='blue'>Concatenate Dataframe with Series</font>

In [21]:
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [22]:
df = pd.concat([temperature_df,s],axis=1)
df

       city  temperature  event
0    mumbai           32  Humid
1     delhi           45    Dry
2  banglore           30   Rain